#!/usr/bin/env python
# coding=utf-8
#######################################################################
#    > File Name: cons.py
#    > Author: cuiyufei
#    > Mail: XXX@qq.com
#    > Created Time: 2024年5月20日
#    > description: 通用变量
#######################################################################

ema_list = [5, 10, 20, 30, 60, 120, 250]
# 1，1，2，3，5，8，13，21，34，55，89，144，233
fib_list = [8, 13, 21, 34, 55, 89, 144]
precision = 2
prices_cols = ['open', 'close', 'low', 'high']
transfer_date_dic = {'D': 'daily', 'W': 'weekly', 'M': 'monthly'}
transfer_date_dic_zh = {'D': '日k', 'W': '周k', 'M': '月k'}
lrb_ret_columns = ['报告日', '营业总收入', '营业总收入同比',
               '营业总成本', '营业总成本同比',
               '营业利润', '营业利润同比',
               '利润总额', '利润总额同比',
               '净利润', '净利润同比',
               '归属于母公司股东的净利润', '归属于母公司股东的净利润同比',
               '销售毛利率', '销售净利率', '销售成本率',
               '净利润/营业总收入(%)', '营业利润/营业总收入(%)', '息税前利润/营业总收入(%)',
               '营业总成本/营业总收入(%)', '销售费用/营业总收入(%)',
               '管理费用/营业总收入(%)', '管理费用(含研发费用)/营业总收入(%)',
               '财务费用/营业总收入(%)', '研发费用/营业总收入(%)']
# 一个公司常年，应收账远远小于应收账款，大概率会是一家好公司
zcfz_ret_columns = ['报告日', '货币资金', '短期借款', '有息负债', '银行存款', '有息负债率', '货币资金/总资产(%)',  '应收账款', '应付账款',
                    '应收票据', '存货']
xjll_ret_columns = ['报告日', '总资产', '总负债',
                    '资产负债率', '存货']
