#!/usr/bin/env python
# coding=utf-8
#######################################################################
#    > File Name: cons.py
#    > Author: cuiyufei
#    > Mail: XXX@qq.com
#    > Created Time: 2024年5月20日
#    > description: 通用变量
#######################################################################

ema_list = [5, 10, 20, 30, 60, 120, 250]
precision = 2
prices_cols = ['open', 'close', 'low', 'high']
transfer_date_dic = {'D': 'daily', 'W': 'weekly', 'M': 'monthly'}
lrb_ret_columns = ['报告日', '营业总收入', '营业总收入同比',
               '营业总成本', '营业总成本同比',
               '营业利润', '营业利润同比',
               '利润总额', '利润总额同比',
               '净利润', '净利润同比',
               '归属于母公司股东的净利润', '归属于母公司股东的净利润同比',
               '销售毛利率', '销售净利率', '销售成本率',
               '净利润/营业总收入(%)', '营业利润/营业总收入(%)', '息税前利润/营业总收入(%)',
               '营业总成本/营业总收入(%)', '销售费用/营业总收入(%)',
               '管理费用/营业总收入(%)', '管理费用(含研发费用)/营业总收入(%)',
               '财务费用/营业总收入(%)', '研发费用/营业总收入(%)']
zcfz_ret_columns = ['报告日', '总资产', '总负债',
               '资产负债率', '存货']
xjll_ret_columns = ['报告日', '总资产', '总负债',
                    '资产负债率', '存货']
